// Задача 1: Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.

// int a = 322;
// if (a % 7 == 0 && a % 23 == 0)
// {
// Console.WriteLine("да");
// }
// else
// {
// Console.WriteLine("нет");
// }

// Задача 2: Напишите программу, которая принимает на вход координаты точки 
// (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер координатной четверти плоскости, в которой находится эта точка.
// ЭТУ ЗАДАЧУ Я НЕ ПОНЯЛ КАК ДЕЛАТЬ!!!!!


// Задача 3: Напишите программу, которая принимает на вход целое число из отрезка [10, 99] и показывает наибольшую цифру числа.

// int number = 13;
// int a = number % 5;
// int max = a;

// Console.WriteLine($"Максимальное число {max}");

// Задача 4: Напишите программу, которая на вход принимает натуральное число N, а на выходе показывает его цифры через запятую.

int number = 456;
int a = number / 100;
int b = number / 90;
int g = number % 10;

Console.Write(a + ",");
Console.Write(b + ",");
Console.Write(g);

